HengeLiu/RealtimeAgent/examples/for-blind-app/devices/native-esp32-glass/firmware/sdkconfig.defaults
# ESP32-S3 默认配置

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash Size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM/SPIRAM 配置（用于摄像头帧缓冲区）
# ESP32-S3-WROOM-1-N16R8 使用 Octal PSRAM（8线模式）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=-1
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192

# PSRAM Clock and CS IO for ESP32S3
CONFIG_DEFAULT_PSRAM_CLK_IO=30
CONFIG_DEFAULT_PSRAM_CS_IO=26

# 主频设置
CONFIG_ESP_DEFAULT_CPU_FREQ_240=y

# WiFi 配置
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# WebSocket 配置
CONFIG_ESP_WEBSOCKET_CLIENT_ENABLED=y
CONFIG_ESP_WEBSOCKET_CLIENT_TASK_STACK_SIZE=4096
CONFIG_ESP_WEBSOCKET_CLIENT_TASK_PRIORITY=5
CONFIG_ESP_WEBSOCKET_CLIENT_NETWORK_TIMEOUT_MS=5000
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# 内存配置 - 允许任务栈使用PSRAM
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# 日志配置
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# JSON 支持
CONFIG_JSON_MAX_TOKEN_SIZE=512

# 唤醒词模型 - 启用 "Hi 乐鑫" (wn9_hilexin)
CONFIG_SR_WN_WN9_HILEXIN=y
